#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "59109529b862405026ab30a212337945" -> "af34bce947455c56e49c27a0d8077567"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "786afdfc5e23db22c60e3cdce976bd29" -> "0f4c3c6f7e5a6b1a79f64f21481f7d2e"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "bc6d00cd2d6ef20e5d0f044bec43317b" -> "5e9e367c48d5496bc99d84c0be039c75"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "d8a7065af7797eeccc8e1f6474a2cda9" -> "51d25ab26e89a4bc9bcd4a7fb2668ae8"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "ce8e66d7929d3bed051db73d1336882a" -> "02c4243b160309f4fe1d0aa62dcf6645"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "8d1f4fb13d8b69d716945640695aae4c" -> "aa3c054fb9a5c2fe00da6311faae04d7"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "640ef1d30cc8c676602d77ad43a2df24" -> "b64e3289e72c0c3c3316976d33deb5d6"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "7243ba16cfeda405a39b5a157122a431" -> "962764099bd1bce0f2d14ed7816c8c76"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "183ed4596bce81a9d1b0706ec05b2707" -> "9da54664268a30911ece64913a5cd924"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "0f4705f5c47bb28ecd25d1d5911e7fbf" -> "145236e241aff7e2406d807d5fa3d138"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "24447e3c0ef8c03862445f4903e53c97" -> "03250f3d60ed6a0d739c44e8db89e0f2"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "d20b0be2832af54fb8c780b5df0ec8d0" -> "05cec31586e4982235c58ae6bed48c50"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "42943f032cda67ff70ec103f7eff6822" -> "84ff9c65cca1b98baacb6683dd5c2068"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "9eb0bc7abb1305fcce24c794c0d93106" -> "5b4d2af7215e1511e821f4964ab7e0ec"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "ebb647ba701ae70603275d7d3705e3b3" -> "0276a943b6f699b19c5f0dd369879484"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "fd670b88e6d400d4e5106e22bdf9b681" -> "d0eacad51cb42520ae7927da9dff24e5"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "0386cc15e103c255d1e497db5e5d470e" -> "f2dcbe6d431fdeef999fdf763d0382e9"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "be4cd198f204f6dfdc7f79103a6550fb" -> "afe384d8f7d124a3870bdd04cde30e4f"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "df53a95efdc4752a3d259d7ad2ce2f52" -> "9b6c92167947c3f3459a3f92f9a9aeb5"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "8bbc7213914231237e3cb8a6ddb0c637" -> "a1674ab6cf7a5fefe60b228a0af4b55b"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "7f477898286c1c9d99e04018c9734635" -> "33e5dadfdab9f2a5832ba7f5f83632a4"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "b3eb58e90b2bc5d259d9500d75581d0e" -> "129b6f044c699873714f7f06bbd9288f"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "9172ed92b557543afb85d7b494e66389" -> "24719fd27ad4d035592dbb8544a4d622"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "f82782064b776f5002981133805ed64c" -> "9b7aeef2619386ece3be8d8be67b8a9a"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "9788ff6d2a0acf4ab10ee94fde39b897" -> "f3a560b794a798608142d3caa5341c8a"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "03e1e9a10ea957801e7018fc347b0928" -> "4e6d02bf851a8107c0fb99b98b8dd13b"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "153794310a7533ac14603649f0efcf56" -> "88f388b03d27983d5abbd972f41b4ff1"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "bffb163b6cadf2caef714c42f78b2771" -> "bf646d39babc6ce3a9eb882dfb53ce48"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "fdd82b856b9ab1a7dc04a61c939503fa" -> "6000453b7f2a75213c649e42c9118a79"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "0c81b05a67d63b7e74331bfc7e39e4ba" -> "99c3146608a193308dbffcd8322a2e87"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "b653cf6c8be483286da4a68dff4406c1" -> "b2c83243c59e657a4ea7759449b44483"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "0c3845ef2cf149f4ddaadde56818c310" -> "2cb5ac22a58ec00ca0fd6c0d9ae72b46"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "4dab210569d0cdea4c341bf5d468b6f2" -> "625939935088b50fb028d4716b262277"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "1c76021e4b9f2acc5357abab82e0896e" -> "694ee4dd0cf187bed07c030f14cee76f"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "4fd3d4974ddcee3a3299873520e1b1a5" -> "9d0502cdc575eab0326fa3c81bd8ec1f"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "bc272945b588d69a731b9f0f1fac5a06" -> "bc7e738dc44149d5631e18aed3406e45"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "e9721a7ae621d772e52c529a73dbaeef" -> "92937c40417b35dcede25e9c2d067c54"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "826cc90e0e174f700a8631ffddcb7bb3" -> "a6f9d1d05ba06ad1a11f1a537abc37cd"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "67bd988e9bd93d734e50df14a6613566" -> "9c1b7ce938408e893812b433e88b74a8"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "a90fe34b6a1a7937e76e2c73a454cee4" -> "fc05dc65afff3d8c43530905320a15d6"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "de7a6f2d947b9e405f8ae44ffe88f70f" -> "372d18078fbf689df35df30e54df3bea"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "02185a01236ba10490afa6e8c3d33e24" -> "60c47eaa4143b37054b0d0b312ba6b73"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "cf91d98537a20fceedc6e8ca0964fba4" -> "7f27ea4d008a89b3102638b686380812"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "3cfddd7419887b8dc1aa3fbd79cc2e7e" -> "72ae5e953d172778071d9b5fe4a91d98"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "688a2fcce0ca4ddea38fb64913fdcf69" -> "39204f1b7d4bd521ffabc0e366ce026a"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "5a7785e5ce20354666bd0b1bdef918fe" -> "a127dca201c28d163d74e585099e4ad3"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "7b23273347bc213cb703c5a7ee5f4a43" -> "930f323d27777fb4873e85890f448d71"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "sCoikEC30zvJMt1/fCPQb2iFxpmSFBPEBDnZlxTwXSo=" -> "ywP6aV1wuLfDx8eeEmUCr3YfDnqBxrYaLaPmd8d+khM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "JiD2k6IcPCKtaouMcFIxa5W7itysuz5oU7p6YSxxJzM=" -> "alGQ4MELeSx7PuVUjiSTfjBapiVgT7Jeku4PNn9uIMI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "aCuH9F3lFVh7q7bG48HfVjAWJwDVKJ6sfHZwr1Tdd74=" -> "fyNHkK8Ij9Stp2pnlLgoUn8mjqo6XN0OdoFcSQeARlI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "38p1DgXoHWHdvNYCaWxi73oWcA/HuyOVkIT5oEAUA48=" -> "atneF2mDOkbEgaaKMf3k9SY5AOU4nLk8h0YIPpOXX6k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "qvkQC5ijMEO53xTeMPnDmHdxom2r8LpxJOWiHteT4Yo=" -> "rPjgAhWFcu+BR9RrsDZ7S7hnhKMKb1C3pX4gq/HdlAU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "GWZFICI16Mmnitls4oICL9gJGxRmHUbtdIA2WMb+yt8=" -> "NqtbLvZmvUBkX+v8FJeCoinBfw/y+da5O8WrOq1dDtc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "NWjIrj+RRvnfUL1FDgQca3zatoqvyji7stfgatWySj0=" -> "QiOBGrrcf8Gl3Os8KvpYwva85AfXwUaJTVaBK+gpWjI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "c8+fyGXo6On9CVDsENNC3DzLE3hqtVuAuwwIsaEaa6c=" -> "9y4V/HY+T2DEmScp4BTC/gEXnk0z32lP/vPShubs4CI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "yKvHYEcpKRSyX7rnGyF6B7IGKoh+vdltaGY3rpcqdKo=" -> "5JEOBpy8ujNxUWeuxTZEhnUqJ0pfn74xKStPSykqeYQ="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "qojgTDYT6Ub0KKt7905ehhRw0KkOarA8RoWyHnBd+vA=" -> "sJ6iWMfg4hfzD0aP8kDGKPGlzfSIxcGudWbMPfWw2TQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ2dZzrcamyTXC7o9acgxyKCTewbdB56Mdd2+BwyQ/8=" -> "iCde+Mg6ZTO8mKGmjYygtdVVQlKlVadQbNMoCHm1aDU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "6GiMO4XimdCmYkQt8vfTM4REHKSLRKCQGTU9OQqTjn0=" -> "aj9tRXfHeSecHDtIuwH0eVXrQekFOBvofdDeTRaMyPs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "yZ3TypB3WSmN22FAI2IZqF7nTNfSEAmDtEti/alRq+I=" -> "quYsB8xvhtIJlDphuvO8Raslb3jcfdHiSBzr79tkpao="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "p7tKz+J81GNbBZ5DFM816T6q3O6k4PdeYnNKLYTNojs=" -> "zMj7OeSa9wwDok4sgwRVvilCBcnXkI+jRoqw4q9jYt4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "/xyE9vXplVnn/dG+DDp4h7H2h2m6ERMh7g0fI17N2Hc=" -> "ZxjxOer5CUWYHd7LNcJ2McxVNXGE85A/xBoAmw0kmPs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "xa/302K44/xgMEo/c7iW79y+8xTh+jf6cjxrzCVXohc=" -> "LYDvUnsHTohUOeINZqrIyJNE+0wcOs6i9t2RO3mHQhc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "xp4m5RykDHlvFYKP774h1NMLN1WdUcTXaWZPopu2B/Q=" -> "qz98iy2TVUoSYa8eIQX2toGyPwWfPVoI/jqC2FVOCKk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "FofZCyh15v+D3Ezz1gbtARiSATUmk0fluwfzsw9BoX0=" -> "JM/S1CRPTTxumv2BPC2Vue1ozk3rdMqe722Im/OQo30="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "UUcCiNdh6txDzYU/A5vM9tmVCd5WAPOBOjxGDBaEvHc=" -> "RedEewrkExD23AvXgY733Lx1RF0yL6cnzNftm+1+pb0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:34:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "2KOgushnSteholebq0lNY95fEqJvutNKhwLiScwreRw=" -> "UtJhQbuj8Dv4rtfu7rDbfLHg7pUerURsW2UvhWVQ9gY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "C7K82XGHsQachb5phRs+jwGr/BriEG8/M6c2zFYg1Io=" -> "E7gMWVlOpYAAMLhudxWRO+fX9AVxKSp7rMwYgfAwW9E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "RuBPGp+2SuMbTRSVt9Smj1gmVjKyZDLn3cQeMH1vY+c=" -> "thVNtTXFPCQWNXM0FMupndF9B5bOhWH73sm1tk99cJU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "GEe0ku9n4Osbe6BbfAoT5fpe/3SzzxKBcGWDeu6iyko=" -> "mfNQWeaIQswK1WT8F/N0hBZdGIbwpPhwPjgZDkjI/DA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "SH01WAsAaKusxQXaoOG6TikVVzCHCijE4C+xfcAHpWU=" -> "aKDqzR3JsAXx/N8m00fkAIcs6pU4MU24qF7sHpkQxfE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "BbbEesoy20k7RNHw/kC4rpml+rCef/bpY+nsqdUcR4w=" -> "5nPBLa01OCKlFafwbEeHnzVWt4xJf9HKoYStt+h4/WI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:50:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "7lec+69anKp+qySn71v4lYZExCLquN/6gek4R0VPEO4=" -> "xWrj9poeDidHeQ6gWIfhYwxnkXjbmRN5B8DAaXw8cfo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ca7VqEBRd1sG8L+24gex6ElrC1rZneDTCuguZG+H2hY=" -> "WTtN1p4/cXmL5u2rQ98CXN9E3sKiLeniJ2mM89u5cG4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "JWHxTlg5Q+Z+R2LZrT3qqWgXn0+WfWbYe6Zlwsvvrlw=" -> "gH4s976mvxEeXQ7X3LW6JX0lk2wFqm2y3PVtOLvajdU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-22T18:40:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "FzOz6jOnS4O7JoKkeXcAvZorfBUo1oJbyYvkIDZy6Gw=" -> "yTglN1ZAX7UvXvtMDmBSvUmVa+wLD3mJz0c6g1wQefg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "s1jtTsgLy8BLv6GdDOREYLMASbYG5U9WKaoYKl8ECkE=" -> "srj5LfqH7k7v0p+LVKHFMEWjXemDXcfQphtSwRKn63c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-23T18:43:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "pThIoC4pBqBX/bccnbZCxGBT0cp9JVZ5/afOIK/CM9Y=" -> "3a2yANl/phg4yYYMsDeaD80Qcn7f+E41qpW2axyEX44="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "YckJBSVlrHUF9UtqxJRUYxsLU7rvpsNsy9Wiy/RiXtA=" -> "xho4hTAf3s7qVAgeMy2zLKpcWNWXZeJ0ZqFuoMboS+I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "alVJxTV2UeyfGMInaIxRmlO7TF7dO1UcOsT+TKCeMhc=" -> "VCI3eqcQH0+ks8D9AElF9XqQ+HMxJrm0RG+vdVpCsdo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "kpGmehOTAedxtpxhdFrfmTMUNGNKV2Lp/rkYdv0R+nI=" -> "JfnCZhBNdVNSfZ5qXk6nSzfJYZ2TRcOaiqec5HNTGxk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOkK10OtJWgsmxfz9CyYLuYJjxahZGDWBZYIh5cnjZA=" -> "9w91jkwyvLCpY43O3CXQEV4uiNuJh+RcMxUDI/muPKA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "BryM2VMY//KXPI3EEH2wI2gLXF4tH0r6o+EyM9Der8s=" -> "c1Ez7WeIV8leA81QSx1yzWrzaj40DAYkVcL+Ji2c/fY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "PbcWe7E7x1wr9o/AJsWFMaTtAOTHyNulY3qJrpWAut0=" -> "FJjPjMVh+C4VD8LLqgDynHJ+6jigRco4LQz4DMMDNSU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "vVA+iG7OQml6x7DcX1LmzbdC65UGazOKOUa1EIrm96s=" -> "HsgZnjh61WzTnOtuYM6daDezFKEZo5MQ2c5B3xNSNOI="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "CUGIJeH8habHelQZRnOsdcguCCd9gDJwqrw54ECUmr4=" -> "W1UigCAOvOSBZrYazZIBq8hAXIcH6KCOoL6qX5pkiEo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "iJGpKfKBl+g8pnQwU/Kk9Q1w4wVjK/ngzIcqQQS2bXw=" -> "XltZDsfeKyNdn3Ow8kW6RLjXMaTK6ouFblbU1hQ6Yx0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:11.000+0000" -> (known after apply)
      ~ source_code_hash               = "t1seLdabUX3/GrwSkeDP8iEQhKwxT9ZqSnAvuiVHQCE=" -> "EYum+AN/4sOGr4RSKSz9yQBDZuTcrVVr9Hj+oT2gEV8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "bZPb0rkNMduUtZTNn/LVoocUtJddONklR07wYXGiSmA=" -> "7US095bKm6WrfnnfAdfnsbECRJ8ERxMkI9d5tX9ft0g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "O2s+HdSlOcREm2D4nc3bProI1iDwON1DVe08x0BR2Ow=" -> "6zb/csxaTSEJljN9/0iQOFIpJyRlChge4ExljUr1+iI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "vKAgt2/WRVYqi+8/QYFrI1lMaLjJqGhw+kxNapAYJV4=" -> "t6Rk7PgrTDnyc0LUlsIO1Z9yPyP7cqFHmr2u7K9G3wE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-17T14:53:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "ehKYQXHsw3KWgfz6nWFXs/NeTJlz3xbCnPg+n61pNmg=" -> "CcoDu2NUDlg4Cq+B+0yYOO/HWXs4ge4pwUoEwCDL+aU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-17T14:54:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "64Xsh0e/Kv90AgznN7CuKYLYv8KNYLpk+2CFGHm/A74=" -> "/LR86yu1t0P7BLNKBNs/vrT9bPx6Q0zm0EFBOWrbEtU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-17T14:53:29Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7xufwb" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-17T14:53:28Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 95 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*